<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"5031617f7d2d2c8eab4445b9586950d467e382f2435028c6df25c21395319d51","plan_job_ref":"Job Terraform Plan #324 at https://github.com/cal-itp/data-infra/actions/runs/16006887027","plan_out_hash":"5937c0d048dd20456355e045e4039e112581e36c1c3c87920d34c6e54777eb54","plan_hash":"0fd59c510f393e5e0a21ac65e095480b25a980a4f2ffad7e8255d2cadd6cf34d","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/gke/us__
<details>
<summary>Plan: 1 to add, 5 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_container_cluster.airflow-jobs will be created
+   resource "google_container_cluster" "airflow-jobs" {
+       cluster_ipv4_cidr                        = (known after apply)
+       datapath_provider                        = (known after apply)
+       default_max_pods_per_node                = (known after apply)
+       deletion_protection                      = false
+       disable_l4_lb_firewall_reconciliation    = false
+       effective_labels                         = {
+           "goog-terraform-provisioned" = "true"
        }
+       enable_autopilot                         = true
+       enable_cilium_clusterwide_network_policy = false
+       enable_fqdn_network_policy               = false
+       enable_intranode_visibility              = true
+       enable_kubernetes_alpha                  = false
+       enable_l4_ilb_subsetting                 = false
+       enable_legacy_abac                       = false
+       enable_multi_networking                  = false
+       enable_shielded_nodes                    = true
+       endpoint                                 = (known after apply)
+       id                                       = (known after apply)
+       label_fingerprint                        = (known after apply)
+       location                                 = "us-west2"
+       logging_service                          = (known after apply)
+       master_version                           = (known after apply)
+       monitoring_service                       = (known after apply)
+       name                                     = "airflow-jobs"
+       network                                  = "https://www.googleapis.com/compute/v1/projects/cal-itp-data-infra/global/networks/default"
+       networking_mode                          = "VPC_NATIVE"
+       node_locations                           = (known after apply)
+       node_version                             = (known after apply)
+       operation                                = (known after apply)
+       private_ipv6_google_access               = (known after apply)
+       project                                  = "cal-itp-data-infra"
+       self_link                                = (known after apply)
+       services_ipv4_cidr                       = (known after apply)
+       subnetwork                               = (known after apply)
+       terraform_labels                         = {
+           "goog-terraform-provisioned" = "true"
        }
+       tpu_ipv4_cidr_block                      = (known after apply)

+       addons_config (known after apply)

+       authenticator_groups_config (known after apply)

+       cluster_autoscaling (known after apply)

+       confidential_nodes (known after apply)

+       control_plane_endpoints_config (known after apply)

+       cost_management_config (known after apply)

+       database_encryption (known after apply)

+       default_snat_status (known after apply)

+       enterprise_config (known after apply)

+       gateway_api_config (known after apply)

+       identity_service_config (known after apply)

+       ip_allocation_policy (known after apply)

+       logging_config (known after apply)

+       master_auth (known after apply)

+       master_authorized_networks_config (known after apply)

+       mesh_certificates (known after apply)

+       monitoring_config (known after apply)

+       node_config (known after apply)

+       node_pool (known after apply)

+       node_pool_auto_config (known after apply)

+       node_pool_defaults (known after apply)

+       notification_config (known after apply)

+       release_channel (known after apply)

+       secret_manager_config {
+           enabled = true
        }

+       security_posture_config (known after apply)

+       service_external_ips_config (known after apply)

+       vertical_pod_autoscaling (known after apply)

+       workload_identity_config {
+           workload_pool = "cal-itp-data-infra.svc.id.goog"
        }
    }

  # google_container_cluster.tfer--data-infra-apps will be updated in-place
!~  resource "google_container_cluster" "tfer--data-infra-apps" {
        id                                       = "data-infra-apps"
        name                                     = "data-infra-apps"
!~      node_version                             = "1.31.8-gke.1045000" -> "1.30.9-gke.1127000"
#        (34 unchanged attributes hidden)

#        (21 unchanged blocks hidden)
    }

  # google_container_node_pool.tfer--data-infra-apps_apps-v2 will be updated in-place
!~  resource "google_container_node_pool" "tfer--data-infra-apps_apps-v2" {
        id                          = "us-west1/data-infra-apps/apps-v2"
        name                        = "apps-v2"
!~      version                     = "1.31.8-gke.1045000" -> "1.30.9-gke.1127000"
#        (10 unchanged attributes hidden)

-       timeouts {}

#        (5 unchanged blocks hidden)
    }

  # google_container_node_pool.tfer--data-infra-apps_gtfsrt-v4 will be updated in-place
!~  resource "google_container_node_pool" "tfer--data-infra-apps_gtfsrt-v4" {
        id                          = "us-west1/data-infra-apps/gtfsrt-v4"
        name                        = "gtfsrt-v4"
!~      version                     = "1.31.8-gke.1045000" -> "1.30.9-gke.1127000"
#        (10 unchanged attributes hidden)

-       timeouts {}

#        (5 unchanged blocks hidden)
    }

  # google_container_node_pool.tfer--data-infra-apps_jobs-v1 will be updated in-place
!~  resource "google_container_node_pool" "tfer--data-infra-apps_jobs-v1" {
        id                          = "us-west1/data-infra-apps/jobs-v1"
        name                        = "jobs-v1"
!~      version                     = "1.31.8-gke.1045000" -> "1.30.9-gke.1127000"
#        (10 unchanged attributes hidden)

-       timeouts {}

#        (5 unchanged blocks hidden)
    }

  # google_container_node_pool.tfer--data-infra-apps_jupyterhub-users will be updated in-place
!~  resource "google_container_node_pool" "tfer--data-infra-apps_jupyterhub-users" {
        id                          = "us-west1/data-infra-apps/jupyterhub-users"
        name                        = "jupyterhub-users"
!~      version                     = "1.31.8-gke.1045000" -> "1.30.9-gke.1127000"
#        (10 unchanged attributes hidden)

-       timeouts {}

#        (5 unchanged blocks hidden)
    }

Plan: 1 to add, 5 to change, 0 to destroy.

Changes to Outputs:
+   google_container_cluster_airflow-jobs_ca_certificate                 = (known after apply)
+   google_container_cluster_airflow-jobs_endpoint                       = (known after apply)
+   google_container_cluster_airflow-jobs_name                           = "airflow-jobs"
```
</details>

:memo: Plan generated in [Terraform Plan #324](https://github.com/cal-itp/data-infra/actions/runs/16006887027)